app/Models/FilmModel.php

SELECT `film`.*, `genre`.`nama_genre`
FROM `film`
JOIN `genre` ON `genre`.`id_genre` = `film`.`id_genre`
---
    public function getAllDataJoin()
    {
        $query = $this->db->table("film")
            ->select("film.*, genre.nama_genre")
            ->join("genre", "genre.id_genre = film.id_genre");
        return $query->get()->getResultArray();

SELECT *
FROM `film`
WHERE `film`.`id` = '8'
---
    public function getDataByID($id)
    {
        return $this->find($id);